InformationRegisters/ОтстранениеОтРаботыПоРезультатамОбученияОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОтстранениеОтРаботыПоРезультатамОбученияОхранеТруда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроверкаЗнанияТребованийОхраныТруда</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроверкаЗнанияТребованийОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОтстранения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеРабочихМестСотрудникам</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровыйПереводСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеСписком</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтсутствияССохранениемОплатыПриОбученииОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОтсутствияССохранениемОплатыПриОбученииОхранеТруда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроверкаЗнанияТребованийОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОтсутствия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработкуСписком</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РезультатыПроверкиЗнанияПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыПроверкиЗнанияПоОхранеТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Удовлетворительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неудовлетворительно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПроверкаЗнанияТребованийОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПроверкаЗнанияТребованийОхраныТруда</Name>
			<BasedOn>
				<xr:Item>Document.ОбучениеСотрудниковОхранеТруда</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПроверкиЗнанияТребованийОхраныТрудаСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбученияСотрудниковПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОбучения</Name>
					<Comment>Внутренняя/внешняя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОбученияПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбучениеСотрудников</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчебныхЧасов</Name>
					<Comment>АПК:58 различия имени и синонима оправданы. Длительность курса в часах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротоколаПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обучение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверкиЗнания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыПроверкиЗнанияПоОхранеТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольВКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиЧленовКомиссииОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ВидыИнструктажейПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыИнструктажейПоОхранеТруда</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтролироватьПроведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитсяПовторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляВсехРабочихМест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРаз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьСменуРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьРабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбучениеПоОхранеТрудаФормы/Ext/Module.bsl
// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//   Форма - см. Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.Форма.ФормаЭлемента
//   Объект - СправочникОбъект.ПрограммыОбученияСотрудниковПоОхранеТруда, СправочникОбъект.ВидыИнструктажейПоОхранеТруда - 
Процедура ПриПолученииДанныхНаСервереФормыПрограммыОбучения(Форма, Объект) Экспорт
	
	ПериодичностьДополнитьФорму(Форма);
	ЗаполнитьСписокВыбораПериода(Форма,
		СписокВыбораПериодаПроведенияОбучения(Форма.СсылкаНаОбъект), ПроизвольноеЗначениеСпискаВыбораПроведенияОбучения());
	
	ДанныеВРеквизитФормыПрограммыОбучения(Форма, Объект);
	
	ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(Форма);
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(Форма);
	
КонецПроцедуры

// Параметры:
//   Форма - см. Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.Форма.ФормаЭлемента
//   Объект - СправочникОбъект.ПрограммыОбученияСотрудниковПоОхранеТруда, СправочникОбъект.ВидыИнструктажейПоОхранеТруда - 
Процедура ДанныеВРеквизитФормыПрограммыОбучения(Форма, Объект) Экспорт
	
	УстановитьФлагиПроведения(Форма);
	УстановитьПериодПроведения(Форма);
	ЗаполнитьДеревоРабочихМест(Форма, Объект);
	ОбучениеПоОхранеТрудаФормыКлиентСервер.ОбновитьСвойстваЭлементов(Форма);
	
КонецПроцедуры

// Обрабатывает выбранные рабочие места и добавляет их в форму элемента справочника ПрограммыОбученияСотрудниковПоОхранеТруда.
//
// Параметры:
//   Форма - см. Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.Форма.ФормаЭлемента
//   ВыбранноеЗначение - Массив из СправочникСсылка.РабочиеМестаОхраныТруда, СправочникСсылка.РабочиеМестаОхраныТруда - 
//
// Возвращаемое значение:
//   Булево - признак того, что было добавлено хотя бы одно рабочее место
Функция ВыбранныеРабочиеМестаДобавлены(Форма, ВыбранноеЗначение) Экспорт
	
	РабочееМестоДобавлено = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		ВыбранныеРабочиеМеста = ВыбранноеЗначение;
	Иначе
		ВыбранныеРабочиеМеста = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеЗначение);
	КонецЕсли;
	
	Для Каждого РабочееМесто Из ВыбранныеРабочиеМеста Цикл
		СтруктураПоиска = Новый Структура("РабочееМесто", РабочееМесто);
		Если Форма.Объект.РабочиеМеста.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
			НоваяСтрока = Форма.Объект.РабочиеМеста.Добавить();
			НоваяСтрока.РабочееМесто = РабочееМесто;
			
			РабочееМестоДобавлено = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если РабочееМестоДобавлено Тогда
		ЗаполнитьДеревоРабочихМест(Форма, Форма.Объект);
	КонецЕсли;
	
	Возврат РабочееМестоДобавлено;
	
КонецФункции

// Параметры:
//   Форма - см. Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.Форма.ФормаЭлемента
//   Объект - СправочникОбъект.ПрограммыОбученияСотрудниковПоОхранеТруда, СправочникОбъект.ВидыИнструктажейПоОхранеТруда - 
//   УдалятьПустыеГруппы - Булево - 
Процедура РеквизитФормыПрограммыОбученияВДанные(Форма, Объект, УдалятьПустыеГруппы = Ложь) Экспорт
	
	Объект.РабочиеМеста.Очистить();
	РабочиеМеста = Форма.РабочиеМеста.ПолучитьЭлементы();
	КоличествоСтрок = РабочиеМеста.Количество();
	Для Сч = 1 По КоличествоСтрок Цикл
		ЗаполнитьРабочиеМестаПоДеревуЗначений(Объект, РабочиеМеста[КоличествоСтрок - Сч], РабочиеМеста, УдалятьПустыеГруппы);
	КонецЦикла;
	
	Если УдалятьПустыеГруппы И РабочиеМеста.Количество() = 0 Тогда
		РабочиеМеста.Очистить();
	КонецЕсли;
	
	Объект.ИспользоватьДляВсехРабочихМест = Форма.ПроводитсяДляВсехРабочихМест = 0;
	Объект.ПроводитсяПовторно = Форма.СпособПроведения = 1;
	
	Если Объект.ПроводитсяПовторно Тогда
		СтруктураПериода = ОхранаТрудаКлиентСервер.СтруктураПериодаПоПредставлению(Форма, Форма.ПериодПроведения);
		Если СтруктураПериода <> Неопределено Тогда
			Объект.КоличествоРаз = СтруктураПериода.КоличествоРаз;
			Объект.КоличествоПериодов = СтруктураПериода.КоличествоПериодов;
			Объект.Периодичность = СтруктураПериода.Периодичность;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//   Форма - см. Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.Форма.ФормаЭлемента
Процедура УстановитьУсловноеОформлениеФормыПрограммыОбучения(Форма) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	
	// Выделяем группы
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ВажнаяНадписьШрифт);
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "РабочиеМеста.ВАрхиве", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "РабочиеМеста.ЭтоГруппа", Истина);
	
	ОформляемоеПоле = Элемент.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("РабочиеМестаРабочееМесто");
	
	// Выделяем не используемые
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ЗаголовокУдаленногоРеквизитаШрифт);
	ГруппаОтбораИли = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбораИли, "РабочиеМеста.ВАрхиве", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбораИли, "РабочиеМеста.ПометкаУдаления", Истина);

	ОформляемоеПоле = Элемент.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("РабочиеМестаРабочееМесто");
	
КонецПроцедуры

#Область ОбучениеПоОхранеТруда

#Область РабочееМестоОхраныТруда

// Параметры:
//   Форма - см. Обработка.РабочиеМестаОхраныТруда.Форма.ФормаРабочегоМеста
//   СсылкаНаОбъект - СправочникСсылка.РабочиеМестаОхраныТруда - 
Процедура ПрочитатьОбучениеРабочегоМестаОхраныТруда(Форма, СсылкаНаОбъект) Экспорт

	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.ПрограммыОбученияСотрудниковПоОхранеТруда) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы, "ГруппаОбучениеПоОхранеТруда", "Видимость", Ложь);
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбучениеПоОхранеТруда", Новый Структура("Организация", Форма.Объект.Владелец)) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочееМесто", СсылкаНаОбъект);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрограммыОбученияСотрудниковПоОхранеТруда.Ссылка КАК Обучение,
		|	ПрограммыОбученияСотрудниковПоОхранеТруда.ПредставлениеПериода КАК Период,
		|	ПрограммыОбученияСотрудниковПоОхранеТруда.ИспользоватьДляВсехРабочихМест КАК ИспользуетсяДляВсехРабочихМест
		|ИЗ
		|	Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда КАК ПрограммыОбученияСотрудниковПоОхранеТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.РабочиеМеста КАК
		|			ПрограммыОбученияСотрудниковПоОхранеТрудаРабочиеМеста
		|		ПО ПрограммыОбученияСотрудниковПоОхранеТруда.Ссылка = ПрограммыОбученияСотрудниковПоОхранеТрудаРабочиеМеста.Ссылка
		|ГДЕ
		|	ПрограммыОбученияСотрудниковПоОхранеТруда.КонтролироватьПроведение
		|	И НЕ ПрограммыОбученияСотрудниковПоОхранеТруда.ПометкаУдаления
		|	И ВЫБОР
		|		КОГДА ПрограммыОбученияСотрудниковПоОхранеТруда.ИспользоватьДляВсехРабочихМест
		|		ИЛИ ПрограммыОбученияСотрудниковПоОхранеТрудаРабочиеМеста.РабочееМесто = &РабочееМесто
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|СГРУППИРОВАТЬ ПО
		|	ПрограммыОбученияСотрудниковПоОхранеТруда.Ссылка,
		|	ПрограммыОбученияСотрудниковПоОхранеТруда.ПредставлениеПериода,
		|	ПрограммыОбученияСотрудниковПоОхранеТруда.ИспользоватьДляВсехРабочихМест";
	
	Форма.ОбучениеПоРабочимМестам.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Форма.ОбучениеПоРабочимМестам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
		
КонецПроцедуры

// Параметры:
//   Форма - см. Обработка.РабочиеМестаОхраныТруда.Форма.ФормаРабочегоМеста
//   СсылкаНаОбъект - СправочникСсылка.РабочиеМестаОхраныТруда - 
Процедура ЗаписатьОбучениеРабочегоМестаОхраныТруда(Форма, СсылкаНаОбъект) Экспорт
	
	Если Не (ПолучитьФункциональнуюОпцию("ИспользоватьОбучениеПоОхранеТруда", Новый Структура("Организация", Форма.Объект.Владелец))
		И ПравоДоступа("Изменение", Метаданные.Справочники.ПрограммыОбученияСотрудниковПоОхранеТруда)) Тогда
		
		Возврат;
	КонецЕсли;
	
	Выборка = ВыборкаОбученияРабочегоМеста(Форма, СсылкаНаОбъект);
	Пока Выборка.Следующий() Цикл
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Выборка.Обучение);
		Исключение
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Не удалось заблокировать программу обучения по охране труда ""%1"":
				|%2'"),
				Строка(Выборка.Обучение),
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Продолжить;
		КонецПопытки;
		
		ОбучениеОбъект = Выборка.Обучение.ПолучитьОбъект();
		Если Выборка.Используется Тогда
			НоваяСтрока = ОбучениеОбъект.РабочиеМеста.Добавить();
			НоваяСтрока.РабочееМесто = Форма.СсылкаНаОбъект;
		Иначе
			ОтборСтрок = Новый Структура("РабочееМесто", Форма.СсылкаНаОбъект);
			НайденныеСтроки = ОбучениеОбъект.РабочиеМеста.НайтиСтроки(ОтборСтрок);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ОбучениеОбъект.РабочиеМеста.Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЕсли;
		ОбучениеОбъект.Записать();
		РазблокироватьДанныеДляРедактирования(Выборка.Обучение);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//   Форма - см. Обработка.РабочиеМестаОхраныТруда.Форма.ФормаРабочегоМеста
//   СсылкаНаОбъект - СправочникСсылка.РабочиеМестаОхраныТруда - 
Процедура ПрочитатьИнструктажиРабочегоМестаОхраныТруда(Форма, СсылкаНаОбъект) Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.ВидыИнструктажейПоОхранеТруда) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы, "ГруппаИнструктажиПоОхранеТруда", "Видимость", Ложь);
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьИнструктажиПоОхранеТруда", Новый Структура("Организация", Форма.Объект.Владелец)) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочееМесто", СсылкаНаОбъект);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыИнструктажейПоОхранеТруда.Ссылка КАК Инструктаж,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест
		|					ИЛИ ВидыИнструктажейПоОхранеТрудаРабочиеМеста.РабочееМесто = &РабочееМесто
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК Используется,
		|	ВидыИнструктажейПоОхранеТруда.ПредставлениеПериода КАК Период,
		|	ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест КАК ИспользуетсяДляВсехРабочихМест
		|ИЗ
		|	Справочник.ВидыИнструктажейПоОхранеТруда КАК ВидыИнструктажейПоОхранеТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыИнструктажейПоОхранеТруда.РабочиеМеста КАК ВидыИнструктажейПоОхранеТрудаРабочиеМеста
		|		ПО ВидыИнструктажейПоОхранеТруда.Ссылка = ВидыИнструктажейПоОхранеТрудаРабочиеМеста.Ссылка
		|ГДЕ
		|	ВидыИнструктажейПоОхранеТруда.КонтролироватьПроведение
		|
		|СГРУППИРОВАТЬ ПО
		|	ВидыИнструктажейПоОхранеТруда.Ссылка,
		|	ВидыИнструктажейПоОхранеТруда.ПредставлениеПериода,
		|	ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест";
	
	Форма.ИнструктажиПоРабочимМестам.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Форма.ИнструктажиПоРабочимМестам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
		
КонецПроцедуры

// Параметры:
//   Форма - см. Обработка.РабочиеМестаОхраныТруда.Форма.ФормаРабочегоМеста
//   СсылкаНаОбъект - СправочникСсылка.РабочиеМестаОхраныТруда - 
Процедура ЗаписатьИнструктажиРабочегоМестаОхраныТруда(Форма, СсылкаНаОбъект) Экспорт
	
	Если Не (ПолучитьФункциональнуюОпцию("ИспользоватьИнструктажиПоОхранеТруда", Новый Структура("Организация", Форма.Объект.Владелец))
		И ПравоДоступа("Изменение", Метаданные.Справочники.ВидыИнструктажейПоОхранеТруда)) Тогда
		
		Возврат;
	КонецЕсли;
	
	Выборка = ВыборкаИнструктажейРабочегоМеста(Форма, СсылкаНаОбъект);
	Пока Выборка.Следующий() Цикл
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Выборка.Инструктаж);
		Исключение
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Не удалось заблокировать вид инструктажа ""%1"":
				|%2'"),
				Строка(Выборка.Инструктаж),
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Продолжить;
		КонецПопытки;
		
		ИнструктажОбъект = Выборка.Инструктаж.ПолучитьОбъект();
		Если Выборка.Используется Тогда
			НоваяСтрока = ИнструктажОбъект.РабочиеМеста.Добавить();
			НоваяСтрока.РабочееМесто = Форма.СсылкаНаОбъект;
		Иначе
			ОтборСтрок = Новый Структура("РабочееМесто", Форма.СсылкаНаОбъект);
			НайденныеСтроки = ИнструктажОбъект.РабочиеМеста.НайтиСтроки(ОтборСтрок);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ИнструктажОбъект.РабочиеМеста.Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЕсли;
		ИнструктажОбъект.Записать();
		РазблокироватьДанныеДляРедактирования(Выборка.Инструктаж);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПодключениеВводаНаОсновании

#Область ДокументОтстранения

// Параметры:
//   Форма - см. Документ.КадровыйПереводСписком.Форма.ФормаДокумента
Процедура ДокументОтстраненияПриСозданииНаСервере(Форма, ИмяРеквизитаДатаСобытия = "ДатаСобытия") Экспорт
	
	Основание = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "Основание");
	СотрудникиКЗаполнению = СотрудникиКОтстранениюПоПроверкеЗнанияТребованийОхраныТруда(
		Форма.Объект, Основание, ИмяРеквизитаДатаСобытия);
	
	Если СотрудникиКЗаполнению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнитьФормуОтстранения(Форма);
	Форма["ПроверкаЗнания"] = Основание;
	//@skip-check dynamic-access-method-not-found
	Форма.Подключаемый_ДобавитьСотрудников(СотрудникиКЗаполнению);
	
КонецПроцедуры

// Параметры:
//   Форма - см. Документ.КадровыйПереводСписком.Форма.ФормаДокумента
Процедура ДокументОтстраненияПриЧтенииНаСервере(Форма) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПроверкаЗнания = РегистрыСведений.ОтстранениеОтРаботыПоРезультатамОбученияОхранеТруда.ПроверкаЗнанияДокументаОтстранения(
		Форма.Объект.Ссылка);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ПроверкаЗнания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнитьФормуОтстранения(Форма);
	Форма["ПроверкаЗнания"] = ПроверкаЗнания;
	
КонецПроцедуры

// Параметры:
//   Форма - см. Документ.КадровыйПереводСписком.Форма.ФормаДокумента
//   ТекущийОбъект - ДокументОбъект.КадровыйПереводСписком, ДокументОбъект.УвольнениеСписком -
Процедура ДокументОтстраненияПередЗаписьюНаСервере(Форма, ТекущийОбъект) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПроверкаЗнания") Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПроверкаЗнания", Форма["ПроверкаЗнания"]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДокументОтсутствия

// Параметры:
//   Форма - см. Документ.ОплатаПоСреднемуЗаработкуСписком.Форма.ФормаДокумента
Процедура ДокументОтсутствияПриСозданииНаСервере(Форма) Экспорт
	
	Основание = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "Основание");
	
	Если ТипЗнч(Основание) <> Тип("ДокументСсылка.ОбучениеСотрудниковОхранеТруда")
		И ТипЗнч(Основание) <> Тип("ДокументСсылка.ПроверкаЗнанияТребованийОхраныТруда") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОплатуПоСреднемуПоОбучениюСотрудниковОхранеТруда(Форма, Основание);
	
	Если Форма.Объект.Сотрудники.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнитьФормуОтсутствияССохранениемОплаты(Форма);
	Форма["ДокументОснование"] = Основание;
	
КонецПроцедуры

// Параметры:
//   Форма - см. Документ.ОплатаПоСреднемуЗаработкуСписком.Форма.ФормаДокумента
Процедура ДокументОтсутствияПриЧтенииНаСервере(Форма) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ДокументОснование = РегистрыСведений.ОтсутствияССохранениемОплатыПриОбученииОхранеТруда.ОснованиеДокументаОтсутствия(
		Форма.Объект.Ссылка);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДокументОснование = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнитьФормуОтсутствияССохранениемОплаты(Форма);
	Форма["ДокументОснование"] = ДокументОснование;
	
КонецПроцедуры

// Параметры:
//   Форма - см. Документ.ОплатаПоСреднемуЗаработкуСписком.Форма.ФормаДокумента
//   ТекущийОбъект - ДокументОбъект.ОплатаПоСреднемуЗаработкуСписком -
Процедура ДокументОтсутствияПередЗаписьюНаСервере(Форма, ТекущийОбъект) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ДокументОснование") Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДокументОснование", Форма["ДокументОснование"]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Периодичность

Процедура ПериодичностьДополнитьФорму(Форма)
	
	ДобавляемыеРеквизиты = Новый Массив; // Массив из РеквизитФормы
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СписокВыбораПериодов", Новый ОписаниеТипов("СписокЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПроизвольноеЗначениеСпискаВыбора", Новый ОписаниеТипов("Строка")));
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораПериода(Форма, СписокВыбораПериодов, ПроизвольноеЗначениеСпискаВыбораПериодов)
	
	СписокВыбораЭлементаФормы = Форма.Элементы["ПериодПроведения"].СписокВыбора;
	СписокВыбораЭлементаФормы.Очистить();
	//@skip-check dynamic-access-method-not-found
	//@skip-check property-return-type
	Форма.СписокВыбораПериодов.Очистить();
	
	Для каждого ЗначениеСписка Из СписокВыбораПериодов Цикл
		//@skip-check typed-value-adding-to-untyped-collection
		СписокВыбораЭлементаФормы.Добавить(
			?(ПустаяСтрока(ЗначениеСписка.Представление), ЗначениеСписка.Значение, ЗначениеСписка.Представление));
		//@skip-check dynamic-access-method-not-found
		//@skip-check property-return-type
		Форма.СписокВыбораПериодов.Добавить(ЗначениеСписка.Значение, ЗначениеСписка.Представление);
	КонецЦикла;
	
	//@skip-check property-return-type
	Форма.ПроизвольноеЗначениеСпискаВыбора = ПроизвольноеЗначениеСпискаВыбораПериодов;
	
КонецПроцедуры

#КонецОбласти

Процедура УстановитьФлагиПроведения(Форма)
	
	Форма.ПроводитсяДляВсехРабочихМест = ?(Форма.Объект.ИспользоватьДляВсехРабочихМест, 0, 1);
	Форма.СпособПроведения = ?(Форма.Объект.ПроводитсяПовторно, 1, 0);
	
КонецПроцедуры

Процедура УстановитьПериодПроведения(Форма)
	
	Если Не Форма.Объект.ПроводитсяПовторно Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПериода = Новый Структура("КоличествоРаз, КоличествоПериодов, Периодичность",
		Форма.Объект.КоличествоРаз, Форма.Объект.КоличествоПериодов, Форма.Объект.Периодичность);
	Форма.ПериодПроведения = ОхранаТруда.ПредставлениеПериодаПоСтруктуре(СтруктураПериода);
	Если Форма.Элементы.ПериодПроведения.СписокВыбора.НайтиПоЗначению(Форма.ПериодПроведения) = Неопределено Тогда
		Форма.ПериодПроведения = ОхранаТрудаКлиентСервер.ПроизвольноеЗначениеСпискаВыбораПериодов(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоРабочихМест(Форма, Объект)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочиеМеста", Объект.РабочиеМеста.Выгрузить().ВыгрузитьКолонку("РабочееМесто"));
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РабочиеМеста.Ссылка КАК РабочееМесто,
		|	РабочиеМеста.Владелец КАК Организация,
		|	РабочиеМеста.Подразделение КАК Подразделение,
		|	РабочиеМеста.ВАрхиве КАК ВАрхиве
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМеста
		|ГДЕ
		|	РабочиеМеста.Ссылка В(&РабочиеМеста)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РабочиеМеста.Владелец,
		|	РабочиеМеста.Подразделение,
		|	РабочиеМеста.Ссылка";
	
	РабочиеМестаДеревоЗначений = Форма.РеквизитФормыВЗначение("РабочиеМеста", Тип("ДеревоЗначений"));
	РабочиеМестаДеревоЗначений.Строки.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Организация") Цикл
		//@skip-check invocation-parameter-type-intersect
		//@skip-check property-return-type
		ГруппаОрганизации = ГруппаДереваЗначений(Выборка.Организация, РабочиеМестаДеревоЗначений);
		Пока Выборка.СледующийПоЗначениюПоля("Подразделение") Цикл
			//@skip-check invocation-parameter-type-intersect
			//@skip-check property-return-type
			ГруппаПодразделения = ГруппаДереваЗначений(Выборка.Подразделение, ГруппаОрганизации);
			Пока Выборка.Следующий() Цикл
				НоваяСтрокаДереваЗначений = ГруппаПодразделения.Строки.Добавить();
				//@skip-check property-return-type
				НоваяСтрокаДереваЗначений.РабочееМесто = Выборка.РабочееМесто;
				//@skip-check property-return-type
				НоваяСтрокаДереваЗначений.ВАрхиве = Выборка.ВАрхиве;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	Форма.ЗначениеВРеквизитФормы(РабочиеМестаДеревоЗначений, "РабочиеМеста");
	
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(Форма);
	
КонецПроцедуры

// Возвращает новую строку дерева значений, представляющую группу.
//
// Параметры:
//  Группа			- СправочникСсылка - группа, добавляемая в дерево значений.
//  ГруппаВладелец	- ДеревоЗначений, СтрокаДереваЗначений - владелец группы.
//
// Возвращаемое значение:
//  СтрокаДереваЗначений   - новая строка дерева значений, представляющая группу, или Неопределено, если ГруппаВладелец = Неопределено.
//
Функция ГруппаДереваЗначений(Группа, ГруппаВладелец)
	
	НоваяСтрокаДереваЗначений = ГруппаВладелец.Строки.Добавить();
	//@skip-check property-return-type
	НоваяСтрокаДереваЗначений.РабочееМесто = Группа;
	//@skip-check property-return-type
	НоваяСтрокаДереваЗначений.ЭтоГруппа = Истина;
	
	Возврат НоваяСтрокаДереваЗначений;
	
КонецФункции

Процедура ЗаполнитьРабочиеМестаПоДеревуЗначений(ТекущийОбъект, СтрокаДереваЗначений, Родитель, УдалятьПустыеГруппы)
	
	Если ТипЗнч(СтрокаДереваЗначений.РабочееМесто) = Тип("СправочникСсылка.РабочиеМестаОхраныТруда") Тогда
		НоваяСтрока = ТекущийОбъект.РабочиеМеста.Добавить();
		НоваяСтрока.РабочееМесто = СтрокаДереваЗначений.РабочееМесто;
		Возврат;
	КонецЕсли;
	
	ПодчиненныеСтроки = СтрокаДереваЗначений.ПолучитьЭлементы();
	КоличествоСтрок = ПодчиненныеСтроки.Количество();
	Для Сч = 1 По КоличествоСтрок Цикл
		ЗаполнитьРабочиеМестаПоДеревуЗначений(
			ТекущийОбъект, ПодчиненныеСтроки[КоличествоСтрок - Сч], ПодчиненныеСтроки, УдалятьПустыеГруппы);
	КонецЦикла;
	
	Если СтрокаДереваЗначений.ЭтоГруппа И УдалятьПустыеГруппы И ПодчиненныеСтроки.Количество() = 0 Тогда
		Родитель.Удалить(СтрокаДереваЗначений);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция СписокВыбораПериодаПроведенияОбучения(СправочникСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	1 КАК КоличествоРаз,
		|	1 КАК КоличествоПериодов,
		|	ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц) КАК Периодичность,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ ВТПредопределенныеЗначения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1,
		|	1,
		|	ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал),
		|	2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1,
		|	1,
		|	ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие),
		|	3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1,
		|	1,
		|	ЗНАЧЕНИЕ(Перечисление.Периодичность.Год),
		|	4
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1,
		|	2,
		|	ЗНАЧЕНИЕ(Перечисление.Периодичность.Год),
		|	5
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЭлементов.КоличествоРаз КАК КоличествоРаз,
		|	ТаблицаЭлементов.КоличествоПериодов КАК КоличествоПериодов,
		|	ТаблицаЭлементов.Периодичность КАК Периодичность,
		|	КОЛИЧЕСТВО(ТаблицаЭлементов.Периодичность) КАК КоличествоПериода
		|ПОМЕСТИТЬ ВТВыбранныеЗначения
		|ИЗ
		|	#ТаблицаЭлементов КАК ТаблицаЭлементов
		|ГДЕ
		|	ТаблицаЭлементов.КоличествоРаз <> 0
		|	И ТаблицаЭлементов.КоличествоПериодов <> 0
		|	И ТаблицаЭлементов.Периодичность <> ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЭлементов.КоличествоРаз,
		|	ТаблицаЭлементов.КоличествоПериодов,
		|	ТаблицаЭлементов.Периодичность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыбранныеЗначения.КоличествоРаз КАК КоличествоРаз,
		|	ВыбранныеЗначения.КоличествоПериодов КАК КоличествоПериодов,
		|	ВыбранныеЗначения.Периодичность КАК Периодичность,
		|	ВыбранныеЗначения.КоличествоПериода КАК КоличествоИспользованияПериода,
		|	0 КАК Приоритет
		|ИЗ
		|	ВТВыбранныеЗначения КАК ВыбранныеЗначения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПредопределенныеЗначения.КоличествоРаз,
		|	ПредопределенныеЗначения.КоличествоПериодов,
		|	ПредопределенныеЗначения.Периодичность,
		|	1,
		|	ПредопределенныеЗначения.Приоритет
		|ИЗ
		|	ВТПредопределенныеЗначения КАК ПредопределенныеЗначения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыбранныеЗначения КАК ВыбранныеЗначения
		|		ПО ВыбранныеЗначения.КоличествоРаз = ПредопределенныеЗначения.КоличествоРаз
		|		И ВыбранныеЗначения.КоличествоПериодов = ПредопределенныеЗначения.КоличествоПериодов
		|		И ВыбранныеЗначения.Периодичность = ПредопределенныеЗначения.Периодичность
		|ГДЕ
		|	ВыбранныеЗначения.Периодичность ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоИспользованияПериода УБЫВ,
		|	Приоритет";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ТаблицаЭлементов", СправочникСсылка.Метаданные().ПолноеИмя());
	
	СписокВыбораПериода = Новый СписокЗначений; // СписокЗначений из Структура, Строка
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураПериода = Новый Структура;
		СтруктураПериода.Вставить("КоличествоРаз", "");
		СтруктураПериода.Вставить("КоличествоПериодов", "");
		СтруктураПериода.Вставить("Периодичность", "");
		ЗаполнитьЗначенияСвойств(СтруктураПериода, Выборка);
		СписокВыбораПериода.Добавить(СтруктураПериода, ОхранаТруда.ПредставлениеПериодаПоСтруктуре(СтруктураПериода));
	КонецЦикла;
	
	СписокВыбораПериода.Добавить(ПроизвольноеЗначениеСпискаВыбораПроведенияОбучения());
	
	Возврат СписокВыбораПериода;
	
КонецФункции

Функция ПроизвольноеЗначениеСпискаВыбораПроведенияОбучения()
	Возврат "Произвольно";
КонецФункции

// Возвращаемое значение:
//   ВыборкаИзРезультатаЗапроса:
//    * Инструктаж - СправочникСсылка.ВидыИнструктажейПоОхранеТруда - 
//    * Используется - Булево - 
Функция ВыборкаИнструктажейРабочегоМеста(Форма, СсылкаНаОбъект)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИнструктажиПоРабочимМестам", Форма.ИнструктажиПоРабочимМестам.Выгрузить());
	Запрос.УстановитьПараметр("РабочееМесто", СсылкаНаОбъект);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИнструктажиПоРабочимМестам.Инструктаж,
		|	ИнструктажиПоРабочимМестам.Используется
		|ПОМЕСТИТЬ ВТИнструктажиПоРабочимМестам
		|ИЗ
		|	&ИнструктажиПоРабочимМестам КАК ИнструктажиПоРабочимМестам
		|ГДЕ
		|	НЕ ИнструктажиПоРабочимМестам.ИспользуетсяДляВсехРабочихМест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыИнструктажейПоОхранеТруда.Ссылка КАК Инструктаж,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест
		|					ИЛИ ВидыИнструктажейПоОхранеТрудаРабочиеМеста.РабочееМесто = &РабочееМесто
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК Используется,
		|	ВидыИнструктажейПоОхранеТруда.ПредставлениеПериода КАК Период,
		|	ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест КАК ИспользуетсяДляВсехРабочихМест
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	Справочник.ВидыИнструктажейПоОхранеТруда КАК ВидыИнструктажейПоОхранеТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыИнструктажейПоОхранеТруда.РабочиеМеста КАК ВидыИнструктажейПоОхранеТрудаРабочиеМеста
		|		ПО ВидыИнструктажейПоОхранеТруда.Ссылка = ВидыИнструктажейПоОхранеТрудаРабочиеМеста.Ссылка
		|ГДЕ
		|	ВидыИнструктажейПоОхранеТруда.КонтролироватьПроведение
		|
		|СГРУППИРОВАТЬ ПО
		|	ВидыИнструктажейПоОхранеТруда.Ссылка,
		|	ВидыИнструктажейПоОхранеТруда.ПредставлениеПериода,
		|	ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнструктажиПоРабочимМестам.Инструктаж,
		|	ИнструктажиПоРабочимМестам.Используется
		|ИЗ
		|	ВТИнструктажиПоРабочимМестам КАК ИнструктажиПоРабочимМестам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанные КАК Данные
		|		ПО ИнструктажиПоРабочимМестам.Инструктаж = Данные.Инструктаж
		|ГДЕ
		|	НЕ Данные.ИспользуетсяДляВсехРабочихМест
		|	И ИнструктажиПоРабочимМестам.Используется <> Данные.Используется";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Возвращаемое значение:
//   ВыборкаИзРезультатаЗапроса:
//    * Обучение - СправочникСсылка.ПрограммыОбученияСотрудниковПоОхранеТруда - 
//    * Используется - Булево - 
Функция ВыборкаОбученияРабочегоМеста(Форма, СсылкаНаОбъект)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбучениеПоРабочимМестам", Форма.ОбучениеПоРабочимМестам.Выгрузить());
	Запрос.УстановитьПараметр("РабочееМесто", СсылкаНаОбъект);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбучениеПоРабочимМестам.Обучение КАК Обучение
		|ПОМЕСТИТЬ ВТОбучениеПоРабочимМестам
		|ИЗ
		|	&ОбучениеПоРабочимМестам КАК ОбучениеПоРабочимМестам
		|ГДЕ
		|	НЕ ОбучениеПоРабочимМестам.ИспользуетсяДляВсехРабочихМест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрограммыОбучения.Ссылка КАК Обучение
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда КАК ПрограммыОбучения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.РабочиеМеста КАК
		|			ПрограммыОбученияРабочиеМеста
		|		ПО ПрограммыОбучения.КонтролироватьПроведение
		|		И НЕ ПрограммыОбучения.ПометкаУдаления
		|		И НЕ ПрограммыОбучения.ИспользоватьДляВсехРабочихМест
		|		И ПрограммыОбучения.Ссылка = ПрограммыОбученияРабочиеМеста.Ссылка
		|		И ПрограммыОбученияРабочиеМеста.РабочееМесто = &РабочееМесто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбучениеПоРабочимМестам.Обучение КАК Обучение,
		|	ИСТИНА КАК Используется
		|ИЗ
		|	ВТОбучениеПоРабочимМестам КАК ОбучениеПоРабочимМестам
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Данные.Обучение,
		|	ЛОЖЬ
		|ИЗ
		|	ВТДанные КАК Данные
		|ГДЕ
		|	НЕ Данные.Обучение В
		|		(ВЫБРАТЬ
		|			ОбучениеПоРабочимМестам.Обучение
		|		ИЗ
		|			ВТОбучениеПоРабочимМестам КАК ОбучениеПоРабочимМестам)";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#Область ПодключениеВводаНаОсновании

#Область ДокументОтстранения

Функция СотрудникиКОтстранениюПоПроверкеЗнанияТребованийОхраныТруда(ФормаОбъект, Основание, ИмяРеквизитаДатаСобытия)
	
	Если ТипЗнч(Основание) <> Тип("ДокументСсылка.ПроверкаЗнанияТребованийОхраныТруда") Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеПроверки = Документы.ПроверкаЗнанияТребованийОхраныТруда.ДанныеПроверки(Основание);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДанныеПроверки = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ТаблицаФизическихЛиц = Новый ТаблицаЗначений; 
	ТаблицаФизическихЛиц.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаФизическихЛиц.Колонки.Добавить("РабочееМесто", Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаОхраныТруда"));
	
	Для Каждого СтрокаДанных Из ДанныеПроверки Цикл
		Если Не СтрокаДанных.Проведен Тогда
			ТекстСообщения = НСтр("ru = 'Документ проверки знания требований охраны труда не проведен'");
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ДокументОтстранения) И СтрокаДанных.ДокументОтстранения <> ФормаОбъект.Ссылка Тогда
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'На основании этого документа для сотрудника %1 уже введен документ об отстранении от работы %2'"),
				СтрокаДанных.ФизическоеЛицо, СтрокаДанных.ДокументОтстранения);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДанных.РезультатПроверкиЗнания <> Перечисления.РезультатыПроверкиЗнанияПоОхранеТруда.Неудовлетворительно Тогда
			Продолжить;
		КонецЕсли;
		
		ФормаОбъект.Организация = СтрокаДанных.Организация;
		ФормаОбъект[ИмяРеквизитаДатаСобытия] = СтрокаДанных.ДатаПроверкиЗнания;
		ЗаполнитьЗначенияСвойств(ТаблицаФизическихЛиц.Добавить(), СтрокаДанных);
	КонецЦикла;
	
	Если ТаблицаФизическихЛиц.Количество() = 0 Тогда
		ТекстСообщения = НСтр(
			"ru = 'Проверка знания требований охраны труда не содержит сотрудников, которых требуется отстранить от работы'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ТаблицаФизическихЛиц.Индексы.Добавить("ФизическоеЛицо");
	ТаблицаФизическихЛиц.Индексы.Добавить("РабочееМесто");
	
	Параметры = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	Параметры.Организация = ФормаОбъект.Организация;
	Параметры.ОкончаниеПериода = ?(ЗначениеЗаполнено(ФормаОбъект[ИмяРеквизитаДатаСобытия]),
		ФормаОбъект[ИмяРеквизитаДатаСобытия], ФормаОбъект.Дата);
	Параметры.СписокФизическихЛиц = ТаблицаФизическихЛиц.ВыгрузитьКолонку("ФизическоеЛицо");
	Параметры.КадровыеДанные = "РабочееМестоОхраныТруда";
	
	СотрудникиФизическихЛиц = КадровыйУчет.СотрудникиОрганизации(Истина, Параметры);
	
	СписокСотрудников = Новый Массив;
	Для Каждого СтрокаСотрудник Из СотрудникиФизическихЛиц Цикл
		Отбор = Новый Структура("ФизическоеЛицо, РабочееМесто",
			СтрокаСотрудник.ФизическоеЛицо, СтрокаСотрудник.РабочееМестоОхраныТруда);
		Если ТаблицаФизическихЛиц.НайтиСтроки(Отбор).Количество() > 0 Тогда
			СписокСотрудников.Добавить(СтрокаСотрудник.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокСотрудников;
	
КонецФункции

Процедура ДополнитьФормуОтстранения(Форма)
	
	ДобавляемыеРеквизиты = Новый Массив; // Массив из РеквизитФормы
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ПроверкаЗнания", Новый ОписаниеТипов("ДокументСсылка.ПроверкаЗнанияТребованийОхраныТруда")));
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область ДокументОтсутствия

Процедура ЗаполнитьОплатуПоСреднемуПоОбучениюСотрудниковОхранеТруда(Форма, Основание)
	
	ТипОснования = ТипЗнч(Основание);
	ЭтоОбучение = ТипОснования = Тип("ДокументСсылка.ОбучениеСотрудниковОхранеТруда");
	ЭтоПроверка = ТипОснования = Тип("ДокументСсылка.ПроверкаЗнанияТребованийОхраныТруда");
	
	Если Не (ЭтоОбучение Или ЭтоПроверка) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если ЭтоОбучение Тогда
		ДанныеОснования = Документы.ОбучениеСотрудниковОхранеТруда.ДанныеОбучения(Основание);
	ИначеЕсли ЭтоПроверка Тогда
		ДанныеОснования = Документы.ПроверкаЗнанияТребованийОхраныТруда.ДанныеПроверки(Основание);
	Иначе
		ДанныеОснования = Неопределено;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДанныеОснования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеОснования[0].Проведен Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Документ ""%1"" не проведен'"), Основание);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ФормаОбъект = Форма.Объект;
	ФормаОбъект.Организация = ДанныеОснования[0].Организация;
	ФормаОбъект.ПериодРегистрации = ДанныеОснования[0].Дата;
	ФормаОбъект.ВидВремени = Справочники.ВидыИспользованияРабочегоВремени.ПовышениеКвалификации;
	
	ТаблицаФизическихЛиц = Новый ТаблицаЗначений; 
	ТаблицаФизическихЛиц.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаФизическихЛиц.Колонки.Добавить("РабочееМесто", Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаОхраныТруда"));
	
	Ошибки = Неопределено;
	Для Каждого СтрокаДанных Из ДанныеОснования Цикл
		Если ЗначениеЗаполнено(СтрокаДанных.ДокументОтсутствия) И СтрокаДанных.ДокументОтсутствия <> ФормаОбъект.Ссылка Тогда
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'На основании этого документа для сотрудника %1 уже введен документ ""%2""'"),
				СтрокаДанных.ФизическоеЛицо, СтрокаДанных.ДокументОтсутствия);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.Сотрудники", ТекстОшибки,"");
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТаблицаФизическихЛиц.Добавить(), СтрокаДанных);
	КонецЦикла;
	
	Если Ошибки <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	КонецЕсли;
	
	Если ТаблицаФизическихЛиц.Количество() = 0 Тогда
		ТекстСообщения = НСтр(
			"ru = 'Документ не содержит сотрудников, которым требуется ввести оплату по среднему'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ТаблицаФизическихЛиц.Индексы.Добавить("ФизическоеЛицо");
	ТаблицаФизическихЛиц.Индексы.Добавить("РабочееМесто");
	
	Параметры = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	Параметры.Организация = ФормаОбъект.Организация;
	Параметры.ОкончаниеПериода = ?(ЗначениеЗаполнено(ФормаОбъект.ПериодРегистрации),
		ФормаОбъект.ПериодРегистрации, ФормаОбъект.Дата);
	Параметры.СписокФизическихЛиц = ТаблицаФизическихЛиц.ВыгрузитьКолонку("ФизическоеЛицо");
	Параметры.КадровыеДанные = "РабочееМестоОхраныТруда";
	
	СотрудникиФизическихЛиц = КадровыйУчет.СотрудникиОрганизации(Истина, Параметры);
	
	Для Каждого СтрокаСотрудник Из СотрудникиФизическихЛиц Цикл
		СтрокиПоСотруднику = ФормаОбъект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник", СтрокаСотрудник.Сотрудник));
		Если СтрокиПоСотруднику.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("ФизическоеЛицо, РабочееМесто",
			СтрокаСотрудник.ФизическоеЛицо, СтрокаСотрудник.РабочееМестоОхраныТруда);
		Если ТаблицаФизическихЛиц.НайтиСтроки(Отбор).Количество() > 0 Тогда
			НоваяСтрока = ФормаОбъект.Сотрудники.Добавить();
			НоваяСтрока.Сотрудник = СтрокаСотрудник.Сотрудник;
			Если ЭтоОбучение Тогда
				НоваяСтрока.ДатаНачала = ДанныеОснования[0].ДатаНачалаОбучения;
				НоваяСтрока.ДатаОкончания = ДанныеОснования[0].ДатаОкончанияОбучения;
			Иначе
				НоваяСтрока.ДатаНачала = ДанныеОснования[0].ДатаПроверкиЗнания;
				НоваяСтрока.ДатаОкончания = НоваяСтрока.ДатаНачала;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьФормуОтсутствияССохранениемОплаты(Форма)
	
	ДобавляемыеРеквизиты = Новый Массив; // Массив из РеквизитФормы
	ОписаниеТиповДокументаОснование =
		Новый ОписаниеТипов("ДокументСсылка.ОбучениеСотрудниковОхранеТруда, ДокументСсылка.ПроверкаЗнанияТребованийОхраныТруда");
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДокументОснование", ОписаниеТиповДокументаОснование));
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
